{
  "title": "Rock Bottom",
  "album": {
    "name": "Lucidity",
    "release_date": "2023-02-12"
  },
  "song_release_date": "2023-02-12",
  "description": "In his inaugural track 'Rock Bottom,' from the four-song EP 'Lucidity,' NSigma lays bare his personal battle with the rare and incurable New Daily Persistent Headache (NDPH) disorder. This debut song takes listeners on a poignant journey through despair, chronic pain, and the brink of self-harm, painting a vivid picture of his sophomore year experiences.",
  "produced_by": "Mar Lovace at ClearTrack Studios",
  "lyrics": [
    {
      "section": "Verse 1",
      "text": "Let me take you back to the spring of my sophomore year\nEvery single day getting harder to persevere\nWake up every morning and my head is steady pounding\nTry to run away but the pain is always surrounding\nFeeling trapped\nHandicapped\nI was forced to adapt\nI had to find a way to keep my mental in tact\nBut if I’m being honest I just really do not know if\nI can bear the pain of my recent diagnosis\nAsk the doctor why my head be hurting in a state of permanence\nBut he ain’t got no answer so you know that I was learning quick\nNo one gonna save me, yeah nobody be concerned with this\nI’m reaching for the weed it quickly turned into my burning fix\nHardly seeming like a fix if suffering multiply\nGot me feeling pissed that my chance is never coming by\nTo feel a moment of the bliss but never discussing why\nI keep playing the victim think I’m hitting my"
    },
    {
      "section": "Chorus",
      "text": "Rock bottom rock bottom\nGot me feeling so defeated\nRock bottom rock bottom\nGot my energy depleted\nRock bottom rock bottom\nBut I could be the prevailer\n'Cause a smooth sea never made a skilled sailor"
    },
    {
      "section": "Verse 2",
      "text": "My condition getting worse with time, clearly I remember\nWhen depression overtook my mind later that December\nRefused to open up about my suffering thats hidden\nWhile it bottled up inside as I’m confined, bedridden\nNobody can relate to a disorder so unique\nSo I kept all of the pain within and never chose to speak\nAnd slowly all the suicidal thoughts began to sneak\nIn my mind, went online to go find a technique\nCan’t take it any longer I just want the pain to end\nBut then one day I chose to confide in my closest friend\nI tell him that I’m done with this world and I plan on leaving\nMy eyes filled with tears as I type out my demons"
    },
    {
      "section": "Verse 3",
      "text": "My friend made me a promise I’ll return to good health\nSaid if doctors cannot find a cure I’ll do it myself\nThose words struck a chord helped me see the silver lining\nSharpening my mental sword my perspective redefining\nThis torture in my head it became my greatest weapon\nLetting go my resistance looking like my latest blessing\nStarted to believe that I could hold on for a bit longer\nEvery single ounce of pain it making me a bit stronger\nThings were looking up, feeling love, feeling hope\nFeeling grateful for the challenges allowing me to grow\nNow when my back's against the wall I’m in my element\nI started to build up my worth and work on self development\nCrazy that this came from a conversation on Snapchat\nTurned my headaches from a nightmare to something I laugh at\nWhen all is said and done, I think its a fact that\nI am no longer trapped at"
    },
    {
      "section": "Outro",
      "text": "Rock bottom rock bottom\nDon’t know how I made it happen\nBut I went from rock bottom to forever taking action\nNow the grind is never ending from the winter to the autumn\nMoving through the violent sea 'cause I came from rock bottom"
    }
  ],
  "annotations": [
    {
      "text": "I can bear the pain of my recent diagnosis\nAsk the doctor why my head be hurting in a state of permanence",
      "annotation": "NSigma was diagnosed with New Daily Persistent Headache (NDPH), a chronic headache disorder that doctors were unable to cure."
    },
    {
      "text": "Got me feeling pissed that my chance is never coming by\nTo feel a moment of the bliss but never discussing why\nI keep playing the victim think I’m hitting my",
      "annotation": "NSigma was in a state of severe physical pain 24/7, leading to a mindset of hopelessness and self-victimization."
    },
    {
      "text": "'Cause a smooth sea never made a skilled sailor",
      "annotation": "FDR’s words beautifully encapsulate the message behind 'Rock Bottom' of utilizing a difficult situation for self-growth."
    },
    {
      "text": "And slowly all the suicidal thoughts began to sneak\nIn my mind, went online to go find a technique",
      "annotation": "As NSigma’s state of depression grew worse, he began to seriously consider taking his own life, researching various suicide techniques."
    },
    {
      "text": "My eyes filled with tears as I type out my demons",
      "annotation": "After bottling up his emotions and keeping quiet about his condition, NSigma finally opened up to a close friend on Snapchat, marking the beginning of a transformation that would change his life for the better."
    },
    {
      "text": "Started to believe that I could hold on for a bit longer\nEvery single ounce of pain it making me a bit stronger",
      "annotation": "NSigma’s mindset underwent a dramatic shift, causing him to view his headache disorder as an opportunity to develop mental toughness and face difficult situations with confidence."
    }
  ]
}
{
  "title": "Never Settle",
  "album": {
    "name": "Lucidity",
    "release_date": "2023-02-12"
  },
  "song_release_date": "2023-02-12",
  "description": "In 'Never Settle,' NSigma delivers a powerful message of ambition and resilience. Through his lyrics, he encourages listeners not to settle for mediocrity but to strive for their dreams and break free from societal constraints. The song resonates with themes of self-belief, determination, and the courage to pursue one's true desires.",
  "produced_by": "Mar Lovace at ClearTrack Studios",
  "lyrics": [
    {
      "section": "Verse 1",
      "text": "They said my dream of making music was absurdity\nBut then I went and used it to embrace the uncertainty\nTook me to my limits headed to the unknown\nHad to face all of my demons and break out my comfort zone\nNow I'm on the track and these labels wanna sign me\nRemind me\nHow did all of these rappers get behind me\nShining so bright you would think that all this light would blind me\nBut I would never let the superficial things define me"
    },
    {
      "section": "Chorus",
      "text": "Never settle for a check\nWhen they coming for your neck\nNever take no disrespect\nNever, never\nNever settle for a girl\nYou could change the whole world\nTake a step out of the box and let the greatness unfurl"
    },
    {
      "section": "Verse 2",
      "text": "If you wanna take a different road, wanna be the deviant\nThen faith in your abilities the only real ingredient\nThe criticism that you face is not gon' be real lenient\nThe only thing the system wants is you to be obedient\nAnd I know that it is a hard truth\nSwimming in the water they in they gon' bite you with shark tooth\nSo really think about your perspective in regard to\nThe weight that other people's expectations have upon you"
    },
    {
      "section": "Verse 3",
      "text": "Had a dream of taking flight but it wasn't in compliance\nWith what I thought was possible I always had reliance\nOn staying in my comfort zone but deep up in the silence\nI came to a decision that I would pursue my license\nIn skydiving\nOr at least I would die trying\nOn the other side of fear is the high flying\nLife you've always wanted but you cannot get there by lying\nAbout your true desires or the pressure they applying"
    }
  ],
  "annotations": [
    {
      "text": "Never settle for a check\nWhen they coming for your neck",
      "annotation": "NSigma emphasizes the importance of integrity over material gain, urging listeners to value self-respect and personal goals above financial incentives."
    },
    {
      "text": "Take a step out of the box and let the greatness unfurl",
      "annotation": "This line motivates listeners to break free from conventional limits and explore their full potential, suggesting that greatness lies beyond the boundaries of comfort and conformity."
    },
    {
      "text": "Had a dream of taking flight but it wasn't in compliance\nWith what I thought was possible",
      "annotation": "Reflecting on his aspirations to skydive, NSigma uses this as a metaphor for overcoming fears and challenging personal limitations."
    }
  ]
}
{
  "title": "Paradigm Shiftin",
  "album": {
    "name": "Lucidity",
    "release_date": "2023-02-12"
  },
  "song_release_date": "2023-02-12",
  "description": "In 'Paradigm Shiftin,' the third track from the 'Lucidity' EP, NSigma embarks on a profound journey of self-discovery and spiritual awakening. Drawing from his personal experiences and reflections, he narrates a transformative process where he moves away from materialistic desires to a deeper understanding of life and self, inspired partly by reading the Bible and embracing meditation. The song encapsulates a shift from a life of chasing societal norms to finding peace within oneself, emphasizing the power of perspective in personal growth and encouraging listeners to break free from the mental programs ingrained since childhood to realize their true potential. It’s a call to inner transformation, urging individuals to 'realign the vision' and focus on 'spreading peace and love,' fostering a mindset of resilience, peace, and self-awareness.",
  "produced_by": "Mar Lovace at ClearTrack Studios",
  "lyrics": [
    {
      "section": "Verse 1",
      "text": "Thought that I wanted to live in a mansion\nAll of a sudden I got to expansion\nFound that desire for all the material things\nIn the world I would have to abandon\nOtherwise happiness based on conditions\nEven with everything come to fruition\nSatisfaction only last for a moment\nBut then I be going right back to the mission\nTryna get more but I'm stuck in the cycles\nChasing the bag and the job and the titles\nFeel like there's gotta be more to the life that I'm living\nSo I started reading the Bible\nIt's saying the kingdom of god is within you\nBut I don't know to continue\nWhen all of the people around me\nWould rather escape to the clubs and the venues"
    },
    {
      "section": "Chorus",
      "text": "Think my paradigm is shifting\nRealigned the vision\nSpreading peace and love became the mission\nWishing\nMy mind would not be giving\nInto all the resisting\nFocus on my breath and then I listen, listen"
    },
    {
      "section": "Verse 2",
      "text": "When I let go I think that something stepping in\nHoping that it be infinite intelligence\nCan't really tell but it don't really matter\nI'm looking for peace I ain't looking for evidence\nI got some questions I'm tryna implore\nWhy does the mind always seem to want more\nHow can I know who I am at my core\nWhen the noise in my head is so hard to ignore\nThe only solution I found is detachment\nFrom all the thoughts that are causing harassment\nBreaking the unity into the fragments\nTaking communities into entrapment\nFacing the scorn had to go and transform\nNow I'm feeling I'm reborn like a zombie\nTook out the thorn and I challenged the norm\nNow I'm nonreactive like I'm Gandhi\nDuring hard times there is always a lesson\nThat can be learned for your growth and progression\nBut you could also fall back to regression\nDepending on your perspective and discretion\nI had to go switch up my mindset\nReshaped it from a prime threat\nTo something helping me reach my potential\nI'm starting to think I could shine yet"
    },
    {
      "section": "Verse 3",
      "text": "As they engage in the rage and the violence\nWay too afraid of old age and the silence\nTo ever transcend and be one with infinity\nPick up the pen and express your divinity\nBack in the day I complained 'bout the weather\nBut how could that possibly make my life better\nDon't really answer 'cause that was rhetorical\nManifest all of my dreams like the oracle\nMost of y'all are not aware of the fact\nThat your mind just be running on programs\nThat your subconscious soaked up as a child\nYou want the truth well here you go man\nIf you wanna take back control over your mind\nYou gotta go rewrite your story\nAny limiting belief you can find will get in the way of the glory\nIf you wanna be winning right from the beginning\nYou gotta keep swimming like Dory\nReplace all the doubt with the faith\nThat's about to go take over all of the worries\nAnd once you get rid of your energy blockages\nNothing will stop you from seeing the flawlessness\nAll of the love and the peace and the confidence\nAlways within and locked in by your consciousness"
    }
  ],
  "annotations": [
    {
      "text": "Otherwise happiness based on conditions\nEven with everything come to fruition\nSatisfaction only last for a moment\nBut then I be going right back to the mission",
      "annotation": "NSigma reflects on the fleeting nature of happiness derived from materialistic pursuits, realizing that such joy is conditional and temporary."
    },
    {
      "text": "Focus on my breath and then I listen, listen",
      "annotation": "NSigma alludes to the meditation technique of breath focus, encouraging a practice of mindfulness and inner listening as a pathway to peace and self-realization."
    },
    {
      "text": "Why does the mind always seem to want more",
      "annotation": "NSigma explores the human propensity for unending desire, illustrating a deep-seated restlessness that often drives individuals to seek more, never finding contentment with what they have."
    },
    {
      "text": "The only solution I found is detachment\nFrom all the thoughts that are causing harassment",
      "annotation": "NSigma portrays ego detachment as a necessary step towards finding true peace, suggesting that identifying with something greater than one’s personal ego can break the cycle of dissatisfaction and turmoil."
    },
    {
      "text": "But you could also fall back to regression\nDepending on your perspective and discretion",
      "annotation": "NSigma highlights the delicate balance between progression and regression, noting that individual perspective and discretion can significantly influence one’s path."
    },
    {
      "text": "Wanting the presence the best medication\nCalming my essence the blessed of the nation",
      "annotation": "NSigma articulates a longing for presence and inner peace, considering it the ultimate “medication” for soothing his spirit."
    },
    {
      "text": "To ever transcend and be one with infinity\nPick up the pen and express your divinity",
      "annotation": "NSigma encourages listeners to transcend the physical realm and connect with the infinite, a higher source that we are all inherently a part of."
    },
    {
      "text": "Back in the day I complained 'bout the weather\nBut how could that possibly make my life better",
      "annotation": "NSigma uses the complaint about the weather to illustrate the futile resistance to uncontrollable events, advocating for acceptance over resistance."
    },
        {
      "text": "Most of y'all are not aware of the fact\nThat your mind just be running on programs\nThat your subconscious soaked up as a child",
      "annotation": "NSigma addresses the listeners directly, pointing out that many are unaware their behaviors and thoughts are often the result of unconscious programs absorbed in childhood. He urges listeners to become conscious of these ingrained patterns to truly understand themselves and make meaningful changes."
    },
    {
      "text": "You want the truth well here you go man\nIf you wanna take back control over your mind\nYou gotta go rewrite your story",
      "annotation": "Here, NSigma emphasizes the power of narrative and the ability of individuals to take control of their lives by consciously rewriting their personal stories, shifting away from limiting beliefs to a more empowered self-perception."
    },
    {
      "text": "Any limiting belief you can find will get in the way of the glory\nIf you wanna be winning right from the beginning\nYou gotta keep swimming like Dory",
      "annotation": "Drawing inspiration from the character Dory in 'Finding Nemo,' NSigma highlights the importance of perseverance and the need to overcome limiting beliefs to achieve one's goals, underscoring that continuous effort and a positive outlook are crucial for success."
    },
    {
      "text": "Replace all the doubt with the faith\nThat's about to go take over all of the worries\nAnd once you get rid of your energy blockages\nNothing will stop you from seeing the flawlessness",
      "annotation": "In these lines, NSigma suggests that faith and belief in oneself can overcome doubts and worries. He speaks to the concept of energy blockages as barriers to recognizing one's inherent perfection and potential, advocating for personal growth and the removal of these blockages to reveal one's true self."
    },
    {
      "text": "All of the love and the peace and the confidence\nAlways within and locked in by your consciousness",
      "annotation": "Concluding the song, NSigma conveys that love, peace, and confidence are not external acquisitions but qualities that reside within, accessible through heightened awareness and mindfulness."
    }
  ]
}
{
  "title": "Back to the Basics",
  "album": {
    "name": "Lucidity",
    "release_date": "2023-02-12"
  },
  "song_release_date": "2023-02-12",
  "description": "In the final track of NSigma’s 'Lucidity' EP, titled 'Back to the Basics,' the artist encourages listeners to strip away the distractions and pressures of modern society to find true happiness in self-awareness and authenticity. The song is a powerful message about returning to simpler values and finding peace and fulfillment within oneself.",
  "produced_by": "Mar Lovace at ClearTrack Studios",
  "lyrics": [
    {
      "section": "Verse 1",
      "text": "Yo check it\nI'm about to break it down I ain't talking bout fractions\nTalking 'bout tryna find the life satisfaction\nLiving in a world that be packed with distractions\nEverybody looking for their passion\nTryna make it happen\nBut they drowning in the socials\nSuppressing every problem never opting to be vocal\nCan't really escape even with escapism\nA world full of color seen through a grey prism\nI don't know if you can take it any longer always numbing\nThe mind in due time to the pressure you succumbing\nMaybe if you face yourself instead of always running\nYou can truly start to love the person that you are becoming"
    },
    {
      "section": "Chorus",
      "text": "Back to the basics\nBack to the basics\nRecognize the shadow within and go face it\nBack to the basics\nBack to the basics\nLimiting beliefs gotta go in and replace it\nBack to the basics\nBack to the wall just embrace it\nHappiness within do not chase it\nVictim mentality you gotta go erase it\nI take 'em right back to the basics back to the basics"
    },
    {
      "section": "Verse 2",
      "text": "On the road to success\nWhen everything is falling apart into a mess\nYou gotta have the faith that you'll continue to progress\nIn this game of life which is really like a game of chess\nBe ready for the times you gotta sacrifice a piece\nFor a chance to win it all or to fall in the streets\nGotta stay on deck because life is really sweet\nWhen you recognize that every single setback is a treat\nPeople always said that you can run but you cannot hide\nI tried\nWide eyed\nWhen I found out they lied\nAin't nowhere to run when the demon live within\nThe journey has begun tell me when did it begin\nWas it back when I was looking at the world like my opponent\nOr maybe couple years ago during college enrollment\nAll I know is that I found that the only component\nOf living the good life is living in the present moment"
    },
    {
      "section": "Verse 3",
      "text": "Let these words be a refreshment\nThat every moment of your life is simply an assessment\nTesting\nIf you realize that your best investment\nIs not up in the S&P 500 but it rest in\nThe depths of your subconscious mind\nFeel like I was wasting time\nSeeking all the validation took a little while to find\nTill I started to look inward\nWhen my higher self has been heard\nRealized my potential is unlimited no longer hindered\nAin't talking bout the Hindenburg\nBut I'm blowing up for sure\nNot feeling like an amateur\nAs long as I can keep my word\nIf you can stay unaffected\nBy the doubts that are expected\nYou could have it all just go against the path that is accepted"
    },
    {
      "section": "Outro",
      "text": "Back to the basics\nI break out the matrix\nI break down the part of me claiming I cannot say this\nI change forms I shape shift\nI pray for a spaceship\nSo I could see the bigger picture no contacts or Lasik\nI don't need no basis\nTo go and create this\nMy flow is pervasive\nMy growth is in phases\nI wrote down these phrases\nI broke down these cases\nI had to go take 'em right back to the basics"
    }
  ],
  "annotations": [
    {
      "text": "I'm about to break it down I ain't talking bout fractions",
      "annotation": "NSigma uses wordplay to introduce a deep dive into life’s complexities, steering away from literal fractions towards metaphorical divisions of life's challenges and quests for satisfaction."
    },
    {
      "text": "Living in a world that be packed with distractions",
      "annotation": "This line highlights the overwhelming presence of distractions in modern society, emphasizing the challenge of finding true purpose and satisfaction amidst noise and constant stimulation."
    },
    {
      "text": "Suppressing every problem never opting to be vocal",
      "annotation": "NSigma critiques the common tendency to internalize issues rather than openly addressing them, suggesting that silence can exacerbate personal and societal problems."
    },
    {
      "text": "A world full of color seen through a grey prism",
      "annotation": "NSigma comments on the dulling effect of life's challenges on our perception, suggesting even a vibrant life can seem monochrome through the lens of hardship or disillusionment."
    },
    {
      "text": "Recognize the shadow within and go face it",
      "annotation": "He encourages confronting one's darker aspects, drawing on Jungian psychology to advocate for self-awareness and personal growth."
    },
    {
      "text": "Limiting beliefs gotta go in and replace it",
      "annotation": "This line speaks to the necessity of challenging and changing one’s self-limiting beliefs to foster personal development and achieve one's full potential."
    },
    {
      "text": "Happiness within do not chase it",
      "annotation": "NSigma suggests that true happiness is an internal state, not something to be pursued externally."
    },
    {
      "text": "In this game of life which is really like a game of chess",
      "annotation": "He likens life to chess, emphasizing strategic thinking, patience, and the acceptance of losses as part of larger strategies for success."
    },
    {
      "text": "Every single setback is a treat",
      "annotation": "Challenges are reframed as opportunities for learning and growth, rather than obstacles to be avoided."
    },
    {
      "text": "The only component\nOf living the good life is living in the present moment",
      "annotation": "NSigma highlights the importance of mindfulness and being present as the essence of a fulfilling life."
    },
    {
      "text": "Let these words be a refreshment",
      "annotation": "He hopes his message will invigorate and inspire listeners, providing new energy and perspective."
    },
    {
      "text": "Your best investment\nIs not up in the S&P 500 but it rest in\nThe depths of your subconscious mind",
      "annotation": "The true value lies in introspection and understanding oneself, rather than external financial success."
    },
    {
      "text": "I pray for a spaceship\nSo I could see the bigger picture no contacts or Lasik",
      "annotation": "NSigma expresses a wish for elevated perspective, metaphorically seeking a 'spaceship' to gain a comprehensive view of life beyond the superficial, suggesting clarity of vision comes from broadened understanding, not just physical sight."
    },
    {
      "text": "Back to the basics\nI break out the matrix",
      "annotation": "Here, NSigma uses 'the matrix' as a metaphor for societal constructs and limitations, asserting his return to fundamental truths and personal freedom as breaking away from these constraints."
    },
    {
      "text": "I change forms I shape shift",
      "annotation": "This line signifies NSigma's adaptability and growth, highlighting his ability to evolve and transform in response to his insights and experiences."
    },
    {
      "text": "My growth is in phases",
      "annotation": "Acknowledging personal development as a gradual process, NSigma points out that growth happens over time through different stages and experiences."
    },
    {
      "text": "I wrote down these phrases\nI broke down these cases",
      "annotation": "NSigma reflects on his process of introspection and analysis, using writing as a tool to dissect and understand his life's challenges and lessons."
    },
    {
      "text": "I had to go take 'em right back to the basics",
      "annotation": "He concludes by emphasizing the importance of returning to foundational principles and values as a means of navigating life's complexities and achieving genuine fulfillment."
    }
  ]
}
{
  "title": "Higher Calling",
  "album": {
    "name": "Higher Calling",
    "release_date": "2024-03-29"
  },
  "song_release_date": "2023-06-13",
  "description": "In “Higher Calling,” NSigma takes listeners on a journey of self-discovery and awakening. The song narrates the artist’s realization of his true calling, which is deeply rooted in music. Through intricate wordplay and vivid imagery, NSigma portrays his transition from a state of self-doubt to one of confidence and clarity, emphasizing the transformative power of embracing one’s true calling. The track stands as a testament to NSigma’s lyrical prowess and his commitment to pursuing his passion for music, which he regards as his “higher calling.”",
  "lyrics": [
    {
      "section": "Verse 1",
      "text": "They sleeping they sleeping on me they been tired\nBut I'm wide awake and I'm feeling inspired\nTo pick up the pen and then write me a track 'bout the vision I got when the calling was higher\nStuck in the cycle my life getting cyclical\nCannot recycle my time with the typical\nThen came the change that ignited the flame now I'm running the game like I'm on the elliptical\nThe words are in my head but I cannot feel the confidence\nThe fear and insecurity been filling up my consciousness\nWhat if I put my heart and soul into a verse and then\nThey tell me that I'm on a roll but don't listen again\nI've had 'bout enough with all these hypotheticals\nHolding me back this cannot be acceptable\nCiting my fall and with no parenthetical\nKeeping my gift from the world is not ethical\nLet go of the doubt I let go of the lies\nLet go of limits that do not apply\nI drop the perception of fearing rejection I cannot conform and I cannot comply\nTo that path that was laid out for me by society\nSeeing it clear in a state of sobriety\nFreedom they stole I was playing a role but I spit from the soul so I'm taking propriety\nOver my life everyday till I'm dead\nI'll go against the wire and the grain and the spread\nI'm trusting the vision don't care what they said\nBeen coming alive over getting ahead"
    },
    {
      "section": "Chorus",
      "text": "People always ask me\nWhat drives me to make music\nBut what they don't understand is\nIt's not really a choice\nIt's my destiny\nIt's my higher calling"
    },
    {
      "section": "Verse 2",
      "text": "Now I surrender I'm looking above\nI'm tapped in for passion I'm rapping for love\nI picked up the mic it was feeling so right like how could I acquit my hand fit like a glove\nNothing can stop this now it's all in motion\nLike a water droplet that fall in the ocean\nI merge with my purpose I'm finally sure this the end of my searching I'm no longer broken\nInside is the greatness I gotta express it\nLet go of the need to control imma rest it\nI trust in the path that I'm taking the progress I'm making has led to a change in perspective\nSpent so much time looking down but now I seem to stare higher\nCook so many classics think I'm gonna need an air fryer\nNot yet in my prime guess I'm still a composite\nBut with every rhyme is another deposit\nI'm seeming to be in a state of redeeming believe in the dream and I'm cleaning my closet\nNot fiending for profit\nAnd green I forgot it\nBeen sitting on heat I've been meaning to drop it\nI wasted my life seeking others approval\nPotential was locked but the key in my pocket\nBeen tired of the falling\nBeen tired of the stalling\nThe way I've been acting has been so appalling\nCause I was just a dot took out the crop saw the entire drawing\nThrew away my shot no doubt I'm taking it I'm fireballing\nUsed to play for spots but now I'm making it my higher calling"
    }
  ],
  "annotations": [
    {
      "text": "Stuck in the cycle my life getting cyclical\nCannot recycle my time with the typical",
      "annotation": "NSigma employs repetition and wordplay with “cycle” and “cyclical” to depict a period of stagnation and his refusal to “recycle” his time engaging in mundane, “typical” activities, emphasizing a desire for originality and growth."
    },
    {
      "text": "Then came the change that ignited the flame now I'm running the game like I'm on the elliptical",
      "annotation": "NSigma utilizes a metaphor to describe his active engagement in the music industry, likening it to “running the game like I’m on the elliptical.” The elliptical machine, a staple in gyms, symbolizes his continuous and strenuous effort to succeed in the “game,” which could refer to the music industry or life itself. The “flame” that has been ignited indicates a newfound passion or drive, showcasing a moment of personal awakening where he is fueled by determination and ready to take control of his destiny."
    },
    {
      "text": "What if I put my heart and soul into a verse and then\nThey tell me that I'm on a roll but don't listen again",
      "annotation": "NSigma shares the vulnerability artists often face, expressing the fear that despite pouring his “heart and soul into a verse,” the recognition might remain surface-level, with listeners perhaps offering casual praise without truly engaging with the depth of his work. The phrase “on a roll” carries a double entendre here; while it indicates a streak of success, it is also the title of another song on the same album, adding a layer of introspective critique and complexity to the fear of being overlooked or underappreciated despite earnest efforts."
    },
    {
      "text": "I've had 'bout enough with all these hypotheticals",
      "annotation": "NSigma expresses frustration with the “hypotheticals,” referring to the doubts and what-ifs that have been holding him back, signaling a readiness to move past them."
    },
    {
      "text": "Citing my fall and with no parenthetical",
      "annotation": "NSigma uses a play on words with “parenthetical,” perhaps indicating that his perceived failures or falls are not just a side note but have been a significant focus, and he is ready to change that narrative."
    },
    {
      "text": "I drop the perception of fearing rejection I cannot conform and I cannot comply",
      "annotation": "NSigma shares his decision to not “conform” or “comply” with expectations that don’t align with his vision, rejecting the fear of rejection and choosing to carve out his own path."
    },
    {
      "text": "Freedom they stole I was playing a role but I spit from the soul so I'm taking propriety",
      "annotation": "NSigma uses a double homophone entendre with the word “soul.” On one level, “spit from the soul” refers to rapping from his innermost being, his true self, putting his heart and spirit into his music. On another level, it can be seen as a play on the word “sole,” as in being the only or sole proprietor of his narrative, taking full ownership and control."
    },
    {
      "text": "Been coming alive over getting ahead",
      "annotation": "NSigma expresses his steadfast trust in his own vision, undeterred by others' opinions. The phrase “Been coming alive over getting ahead” is a direct quote from “The Pathless Path,” a book written by Osho and published in 1988. The book emphasizes spiritual awakening and personal realization over materialistic or superficial pursuits. Drawing from the rich philosophical insights presented in the book, NSigma found inspiration in its principles, which advocate for a deeper understanding of self and the journey of personal fulfillment."
    },
    {
      "text": "But what they don't understand is\nIt's not really a choice",
      "annotation": "NSigma emphasizes that his commitment to music goes beyond a simple choice; it’s a compelling force, a necessity rather than a casual decision, indicating the deep-rooted passion and calling that drives him."
    },
    {
      "text": "I picked up the mic it was feeling so right like how could I acquit my hand fit like a glove",
      "annotation": "NSigma alludes to the O.J. Simpson trial, a high-profile case where the fitting of a glove was a pivotal point. The term “acquit” and the mention of a “hand fit like a glove” evoke the famous phrase from the trial, “if it doesn’t fit, you must acquit.” Through this reference, NSigma illustrates the natural and perfect fit between him and his musical endeavor, suggesting that pursuing music is the right path for him."
    },
    {
      "text": "Like a water droplet that fall in the ocean\nI merge with my purpose",
      "annotation": "NSigma crafts a vivid metaphor of a “water droplet” merging with the “ocean” to illustrate his alignment with his true purpose, signaling an end to his search and a newfound wholeness. This imagery not only conveys a deep sense of unity and purpose but also subtly hints at the album art for the project this song is a part of, which features a droplet of water falling into the ocean. The line, therefore, serves a dual purpose: it communicates a personal realization and also foreshadows the cohesive theme and imagery of the upcoming album, creating a strong visual and thematic connection between the lyrics and the album art."
    },
    {
      "text": "Spent so much time looking down but now I seem to stare higher",
      "annotation": "NSigma uses the phrase “stare higher” to illustrate a shift in perspective, moving from a downward focus to looking “higher,” indicating a more optimistic and aspirational outlook. This phrase also serves as a subtle nod to the title of the song, “Higher Calling,” reinforcing the central theme of aspiring for something greater and being guided by a higher purpose."
    },
    {
      "text": "Cook so many classics think I'm gonna need an air fryer",
      "annotation": "NSigma utilizes a culinary metaphor to depict his prolific music creation process, likening it to “cooking” classics, a term often used to describe standout, timeless tracks. The mention of needing an “air fryer,” a modern kitchen appliance known for its efficiency and versatility, serves as a witty exaggeration of his productive output, suggesting a high-quality and substantial yield in his music creation."
    },
    {
      "text": "Not yet in my prime guess I'm still a composite",
      "annotation": "NSigma cleverly plays on the word “prime,” which can have two distinct meanings. On one level, “prime” refers to a state of excellence or the peak of one’s abilities, often used in the context of an artist’s career. On another level, “prime” can also refer to “prime numbers” in mathematics, which are positive integers divisible only by themselves and one. By stating that he’s “not yet in my prime,” NSigma acknowledges that he hasn’t reached the pinnacle of his career but then humorously contrasts it by saying he’s “still a composite.” A “composite” number in mathematics is one that is not prime, meaning it has divisors other than one and itself."
    },
    {
      "text": "Not fiending for profit\nAnd green I forgot it",
      "annotation": "NSigma asserts that his primary motivation isn’t financial gain (“profit” and “green” being slang for money), indicating a focus on the art and the message over materialistic pursuits, emphasizing his pure intentions and passion for music."
    },
    {
      "text": "Potential was locked but the key in my pocket",
      "annotation": "The “key in my pocket” metaphor suggests that he always had the ability to unlock his potential, emphasizing a realization of self-empowerment and the decision to finally share his creations with the world."
    },
    {
      "text": "Cause I was just a dot took out the crop saw the entire drawing",
      "annotation": "NSigma employs a nuanced double entendre. Initially, the word “dot” signifies a small, insignificant part of a larger whole, indicating a sense of personal insignificance or limited perspective. However, he cleverly contrasts this by saying he “took out the crop,” which can be interpreted as removing a portion of an image in photography. By doing so, he metaphorically expands his view and sees “the entire drawing,” suggesting a more comprehensive understanding of his life’s purpose and the world around him."
    },
    {
      "text": "Threw away my shot no doubt I'm taking it I'm fireballing",
      "annotation": "NSigma employs a subtle double meaning. Initially, the phrase “Threw away my shot” evokes the context of the musical “Hamilton,” where it signifies not missing an opportunity. However, NSigma pivots by asserting that he’s “taking it” and “fireballing.” The term “fireballing” can be interpreted in two ways: firstly, as a subtle reference to Fireball Cinnamon Whisky, often consumed as a shot, creating a play on the word “shot.” Secondly, it conveys his newfound determination and fervor, indicating that he’s pursuing his goals with unwavering passion."
    }
  ]
}
{
  "title": "Shine",
  "album": {
    "name": "Higher Calling",
    "release_date": "2024-03-29"
  },
  "song_release_date": "2023-07-18",
  "description": "“Shine” is a captivating track by NSigma, a rising artist in the world of conscious rap. The song embodies the essence of his artistic journey, focusing on the theme of rekindling childhood passions. With lyrical finesse, NSigma reflects on his personal quest for meaning and purpose, encouraging listeners to rediscover their own authentic selves. The song’s uplifting message reminds us that each day offers a fresh start, even after times of darkness. “Shine” serves as a musical beacon, guiding listeners toward self-realization and inspiring them to let their inner light shine. Through this track, NSigma not only showcases his growth as an artist but also his dedication to helping others embrace their true passions and embark on journeys of self-discovery and transformation.",
  "lyrics": [
    {
      "section": "Verse 1",
      "text": "Down this road I wander for direction I’ve been searching\nThen I found this flow I ponder its connection to my purpose\nWhat’s the meaning\nOf being on this earth cause I’ve been dreaming\nFor the reason, the destiny I’m meant to be achieving\nStart to wonder how these people found the work that’s feeling natural\nThe hunger never equal bound to search for real and practical passion\nHunting radical action\nThen something magical happened\nI turned the songs I used to write for fun to actual rapping\nFlow electric cause I go against the wire\nTry to plug me in the wall but then I spark and cause a fire\nLove to fuse it but stay grounded when Im making the connection\nCause the music is my outlet for creative expression\nI feel fulfilled\nBeneath all of the fear I found the skills\nTo turn the lessons learned to something real\nI went from going through the motions overflowing with commotion\nTo the knowing every moment is a thrill\nHad to let the light"
    },
    {
      "section": "Chorus",
      "text": "I’ve been living in the dark\nToday's a new day it’s time for a fresh start\nJust gotta\nListen to your heart\nBetter quit playing these games and play your part\nGotta gotta gotta\nGet outta the tight bind\nStep into your right mind\nWho knows what you might find\nSun always gon' rise after the night time"
    },
    {
      "section": "Verse 2",
      "text": "And now we here\nFinally found my mission on this blue and green sphere\nThere’s a message that I gotta deliver its crystal clear\nOf this lesson I’m the giver so you better listen here\nYou possess a gift unique divine and brilliant\nSo wrap it up and send it out the world is the recipient\nI know it can be hard to find\nHeart and mind\nGotta be like stars aligned\nLet me jog your memory so every one start to shine\nThink back to when you were a child\nWhat were the things that really made you smile\nWas your passion with the fashion so you never lacking style\nOr was your habit in the cracking so they laughing for a while\nSinging writing use the pages\nBringing light in to the shade and\nDrop the mask and go take action make it happen no more waiting\nEveryday closer to death here is your sign don’t disregard this\nMake a way with the first step and be the light show in this darkness\nGotta"
    },
    {
      "section": "Chorus",
      "text": "I’ve been living in the dark\nToday's a new day it’s time for a fresh start\nJust gotta\nListen to your heart\nBetter quit playing these games and play your part\nGotta gotta gotta\nGet outta the tight bind\nStep into your right mind\nWho knows what you might find\nSun always gon' rise after the night time"
    }
  ],
  "annotations": [
    {
      "text": "Then I found this flow I ponder its connection to my purpose",
      "annotation": "The 'flow' has a double meaning, referring to both a rhythm in music and a state of being in sync with one's purpose."
    },
    {
      "text": "The hunger never equal bound to search for real and practical passion",
      "annotation": "NSigma speaks of a deep, unequalled desire for genuine and practical engagement in something passionate, expressing a proactive attitude towards pursuing one's dreams."
    },
    {
      "text": "Flow electric cause I go against the wire\nTry to plug me in the wall but then I spark and cause a fire\nLove to fuse it but stay grounded when Im making the connection\nCause the music is my outlet for creative expression",
      "annotation": "NSigma constructs a vivid electrical metaphor to delineate his energetic and uncontainable approach to music. 'Flow electric' and going 'against the wire' showcases his rebellious and vibrant spirit. This portrayal amplifies as he describes causing a 'spark' and a 'fire,' illustrating his indomitable and spirited nature. Even so, he advocates for retaining a 'grounded' stance, demonstrating a balanced, wise approach to harnessing his fiery energy. By designating music as his 'outlet for creative expression,' NSigma brings the metaphor full circle, signifying that music is the conduit for his energetic creativity."
    },
    {
      "text": "Get outta the tight bind",
      "annotation": "NSigma alludes to the urgency of breaking free from limiting situations or mindsets that restrain one’s true potential."
    },
    {
      "text": "Sun always gon' rise after the night time",
      "annotation": "NSigma encapsulates the theme of renewal that pervades the song, tying back to the earlier sentiment 'Today’s a new day, it’s time for a fresh start.' This phrase mirrors the song’s title 'Shine,' and reassures listeners that, akin to the relentless cycle of day and night, opportunities for growth and renewal are ever-present."
    },
    {
      "text": "Finally found my mission on this blue and green sphere",
      "annotation": "NSigma communicates a profound realization of his life’s purpose on Earth, which he describes as a 'blue and green sphere'—a vivid imagery drawing from Earth’s depiction as seen from space."
    },
    {
      "text": "You possess a gift unique divine and brilliant\nSo wrap it up and send it out the world is the recipient",
      "annotation": "NSigma engages in a clever wordplay revolving around the concept of a 'gift.' He not only refers to a personal, intrinsic talent that everyone possesses but extends the metaphor by urging listeners to 'wrap it up' and present it to the world, effectively turning the global audience into the 'recipient' of this gift."
    },
    {
      "text": "I know it can be hard to find\nHeart and mind\nGotta be like stars aligned",
      "annotation": "NSigma highlights the challenging endeavor of aligning one’s 'heart and mind,' evoking a scenario of rare and perfect harmony described as 'stars aligned.' This phrase conveys the aspiration for a rare, ideal state where emotions and intellect are in harmony, encouraging listeners to strive for this inner balance to unlock their full potential."
    },
    {
      "text": "Think back to when you were a child\nWhat were the things that really made you smile",
      "annotation": "NSigma encourages listeners to revisit their childhood passions and rediscover the simple joys that may have been lost in adulthood."
    },
    {
      "text": "Or was your habit in the cracking so they laughing for a while",
      "annotation": "NSigma refers to the act of 'cracking' jokes, suggesting that comedy and bringing laughter to others might have been a passionate pursuit during childhood."
    }
  ]
}
{
  "title": "IF NOT ME THEN WHO",
  "album": {
    "name": "Higher Calling",
    "release_date": "2024-03-29"
  },
  "song_release_date": "2023-09-15",
  "description": "In the fourth installment from the “Higher Calling” album, “IF NOT ME THEN WHO” rings out as a clarion call to personal responsibility and action. The artist sets a tone of unyielding determination to be the master of his destiny, urging listeners to adopt the same mindset in the pursuit of their dreams. Through a potent mix of self-reflective verses and compelling choruses, the listener is guided through an introspective journey of self-empowerment and realization of one’s potential.",
  "lyrics": [
    {
      "section": "Intro",
      "text": "If not me then who\nIf not me then who\nIf not me then who\nIf not me then who\nLife's a battlefield (If not me then who)\nNo one else can fight your wars (If not me then who)\nOr carry your burdens (if not me then who)\nWhen faced with adversity (if not me then who)\nThere's only one question we need to ask ourselves (If not me then who)\nIf not me then who"
    },
    {
      "section": "Chorus",
      "text": "If not me then who’s gon' make this known\nIf not me then who’s gon' take this throne\nI said let the birds fly Imma stack my stones\nSaid let the birds fly Imma stack my stones\nIf not me then who’s gon' dumb this down\nIf not me then who’s gon' run this town\nI said heavy is the head that wears the crown\nSaid heavy is the head that wears the crown"
    },
    {
      "section": "Verse 1",
      "text": "I struggle on longer but I’m restoring faith with\nDouble entendres in my morning pages\nI’m the righteous king of rap, McQueen is lightning on the track, no 9 to 5 got pots of jacks but I’ve been scoring aces\nThat’s enough about cards though\nImma paint a picture like Pablo Picasso\nJust a young kid from the burbs and he got flow\nSmith with the words but he too afraid to drop those\nIf not me then who\nIf not me then who\nIf not me then who\nIf not me then who\nIf not me then who\nIf not me then who\nIf not me then who\nIf not me then who\nPutting pen to paper toasting tracks like they Pop Tarts\nCook and end up faker boasting stacks so they top charts\nWinning raps predictable they hitching up and hardly fall\nWomen cash and criminals I switch it up like Monty Hall\nI’m knowing not to wonder whether pleasure for my betterment\nMy flow is summer weather under pressure cool like peppermint\nI’m free of wack fillers\nTesting me I rap iller\nStressing these last pillars\nRest in peace Mac Miller"
    },
    {
      "section": "Chorus",
      "text": "If not me then who’s gon' make this known\nIf not me then who’s gon' take this throne\nI said let the birds fly Imma stack my stones\nSaid let the birds fly Imma stack my stones\nIf not me then who’s gon' dumb this down\nIf not me then who’s gon' run this town\nI said heavy is the head that wears the crown\nSaid heavy is the head that, look, look"
    },
    {
      "section": "Verse 2",
      "text": "All I wanna do is rap, leave me be\nI found that time cannot be bought, ChatGPT\nPaper star Michael Scott gotta meet these needs\nI raise the bar like a squat drop to see these knees\n'Cause when darkness blinding guidance elevation strikes the hazy mist\nThe mark is finding silence meditations like Aurelius\nIt’s crazy this\nIs maybe bliss\nTo serve the world like gravy dish\nThe cards that I was dealt I flipped 'em like the safety switch\nIf not me then who gon' freestyle at the drive thru\nEven achieving the dream while I find food\nWorking every day you know that I stay on the grind dude\nUm, sir that’s very great but there’s a line of cars behind you\nFlow getting faster than grub than I’m ordering\nI’m letting laughter and love that was bordering\nOutta my heart and my soul now I’m pouring it\nInto the art and my goals I’m adorning it\nSee through every lie like all the walls I have been trapped within\nNeed to recognize I’m free to fall while this is happening\nThe comfort was dispensable I trust the unconventional\nWill break me out this cage and turn the page to the intentional\nThe stones I’m steady stacking start to sling 'em so I shatter glass\nStudent of the game but I still teach it like a masterclass"
    },
    {
      "section": "Chorus",
      "text": "If not me then who’s gon' make this known\nIf not me then who’s gon' take this throne\nI said let the birds fly Imma stack my stones\nSaid let the birds fly Imma stack my stones\nIf not me then who’s gon' dumb this down\nIf not me then who’s gon' run this town\nI said heavy is the head that wears the crown\nSaid heavy is the head that wears the crown"
    }
  ],
  "annotations": [
    {
      "text": "I said let the birds fly Imma stack my stones",
      "annotation": "Playing off the phrase “kill two birds with one stone,” the lyrics illustrate a shift in focus from achieving two goals at once to setting solid foundations (“stack my stones”) for the future while letting go of fleeting opportunities (“let the birds fly”)."
    },
    {
      "text": "I said heavy is the head that wears the crown",
      "annotation": "This line borrows from the saying “uneasy lies the head that wears a crown,” originating from Shakespeare’s “Henry IV, Part 2.” It underscores the great responsibility and constant pressure that comes with holding a position of power. In the context of the song, it reflects the artist’s acknowledgment of the challenges that come with success and the readiness to face them with a grounded perspective. It suggests a deep understanding of the stakes involved in pursuing a lofty goal, preparing oneself for the leadership and burden that success can bring."
    },
    {
      "text": "I struggle on longer but I’m restoring faith with\nDouble entendres in my morning pages",
      "annotation": "NSigma refers to the habit of writing “morning pages,” a concept pioneered by Julia Cameron in her book “The Artist’s Way.” This routine involves writing three pages of stream-of-consciousness text every morning, a process believed to foster creativity and clarity of mind. By indicating that his morning pages contain “double entendres,” NSigma illustrates his deep-seated knack for wordplay and lyricism, suggesting that he is constantly engaged in the creative process, even during personal reflective exercises aimed at mental and emotional healing."
    },
    {
      "text": "I struggle on longer but I’m restoring faith with\nDouble entendres in my morning pages",
      "annotation": "NSigma refers to the habit of writing “morning pages,” a concept pioneered by Julia Cameron in her book “The Artist’s Way.” This routine involves writing three pages of stream-of-consciousness text every morning, a process believed to foster creativity and clarity of mind. By indicating that his morning pages contain “double entendres,” NSigma illustrates his deep-seated knack for wordplay and lyricism, suggesting that he is constantly engaged in the creative process, even during personal reflective exercises aimed at mental and emotional healing."
    },
    {
      "text": "I’m the righteous king of rap, McQueen is lightning on the track, no 9 to 5 got pots of jacks but I’ve been scoring aces\nThat’s enough about cards though",
      "annotation": "NSigma artfully interweaves references to a standard deck of cards with allusions to the Disney-Pixar film “Cars.” The “righteous king of rap” line showcases NSigma considering himself as a dominant force in the rap industry, with “king” referencing a powerful card in a standard deck. Moreover, “McQueen is lightning on the track” serves a dual purpose, giving a nod to Lightning McQueen, the main character in “Cars,” and portraying NSigma as fast and formidable (“lightning”) in the music industry. The “no 9 to 5” phrase also plays with Lightning McQueen’s racing number, “95,” while simultaneously rejecting the traditional 9-to-5 workday, offering an entendre that showcases NSigma’s dedication to his music over a standard job. He rounds off the array of card and “Cars” references with “That’s enough about cards though,” a statement where the word “cards,” combined with NSigma’s delivery, becomes indistinguishable from “cars.” This creates a homophone entendre that cleverly brings the thematic elements full circle, illustrating a meticulous and artful lyrical construction."
    },
    {
      "text": "Smith with the words but he too afraid to drop those",
      "annotation": "NSigma uses “Smith with the words” to mean “wordsmith,” a term used to describe someone highly skilled in the use of words, especially in writing. The phrasing suggests he has a mastery over lyricism, adept at forging words much like a smith in a forge, yet is hesitant to share his creations publicly."
    },
    {
      "text": "Putting pen to paper toasting tracks like they Pop Tarts\nCook and end up faker boasting stacks so they top charts",
      "annotation": "NSigma uses a clever simile, “toasting tracks like they Pop Tarts,” to describe his genuine and warm approach to crafting music, highlighting the care and authenticity he puts into his work. Contrasting this, he critiques other artists for compromising their authenticity, “boasting stacks” of presumably ill-gotten gains to “top charts,” indicating a superficial approach to music creation aimed merely at commercial success."
    },
    {
      "text": "Winning raps predictable they hitching up and hardly fall\nWomen cash and criminals I switch it up like Monty Hall",
      "annotation": "NSigma criticizes the predictability and superficiality in the rap game, drawing a parallel to a widely recognized probability puzzle with the line “I switch it up like Monty Hall.” This is a direct reference to the “Monty Hall problem,” a famous probability puzzle that originated from the game show “Let’s Make a Deal,” hosted by Monty Hall. The problem illustrates the counterintuitive probability of winning a car if a contestant switches their choice of door after one of the doors they didn’t pick is opened, revealing no prize. NSigma is emphasizing his choice to diverge from the norm and switch things up in a landscape of predictable and shallow tracks, enhancing his chances of making a genuine impact."
    },
    {
      "text": "My flow is summer weather under pressure cool like peppermint",
      "annotation": "NSigma creates a clever play on words using “peppermint” to describe his flow as both hot (“pepper”) and cool (“mint”), a fitting analogy for summer weather which can be scorching yet refreshing. This mirrors his adaptable nature and ability to remain composed under pressure, offering a fresh and spicy delivery in his music."
    },
    {
      "text": "Rest in peace Mac Miller",
      "annotation": "NSigma pays homage to the late Mac Miller, a respected artist in the hip-hop community who tragically passed away in 2018. Mac Miller is known for his profound lyrics and unique sound, showcasing a deep understanding of life’s complexities through his music. NSigma acknowledges Miller as an inspiration, reminding listeners of the gravity of his loss while potentially signifying a torch being passed to the next generation of thoughtful and introspective artists."
    },
    {
      "text": "I found that time cannot be bought, ChatGPT",
      "annotation": "NSigma crafts a double homophone entendre playing with the words 'bought' and 'bot'. 'Bought' refers to acquiring time, while 'bot' is a nod to ChatGPT, a well-known AI developed by OpenAI. This line reflects on the irreplaceable nature of time and the advancements in technology, suggesting that while AI like ChatGPT can offer assistance, it cannot replace the genuine human experiences and creativity."
    },
    {
      "text": "Paper star Michael Scott gotta meet these needs I raise the bar like a squat drop to see these knees",
      "annotation": "NSigma nods to Michael Scott from 'The Office,' symbolizing a sense of leadership and a drive to meet personal goals. Following up with 'I raise the bar like a squat drop to see these knees,' NSigma employs a gym-related wordplay, using the literal action of raising a bar during squats to metaphorically depict setting higher standards and showcasing determination and effort."
    },
    {
      "text": "'Cause when darkness blinding guidance elevation strikes the hazy mist The mark is finding silence meditations like Aurelius",
      "annotation": "NSigma plays with words to craft a double homophone entendre where 'mark is' phonetically mirrors 'Marcus,' referencing Marcus Aurelius, the Stoic philosopher and Roman emperor. He advocates for meditation as a potent tool for finding silence and clarity amidst chaos, akin to Aurelius' reflections."
    },
    {
      "text": "It’s crazy this Is maybe bliss To serve the world like gravy dish",
      "annotation": "NSigma expresses the idea of serving others as a pathway to fulfillment, likening his service to the world to serving gravy, a staple that enhances a meal. This metaphor underscores his belief in the nourishing and enriching role that service to others can play."
    },
    {
      "text": "Um, sir that’s very great but there’s a line of cars behind you",
      "annotation": "In this line, a drive-thru worker interrupts NSigma’s flow with a reminder of the growing line of cars behind him, bringing a moment of humor and grounding the scene in a very real and ordinary setting. It portrays NSigma’s passion for music being so encompassing that it spills into everyday activities."
    },
    {
      "text": "Flow getting faster than grub than I’m ordering",
      "annotation": "NSigma plays on the term 'fast food,' likening the speed of his rap flow to the speed of the 'grub' he is ordering at the drive-thru."
    },
    {
      "text": "See through every lie like all the walls I have been trapped within Need to recognize I’m free to fall while this is happening",
      "annotation": "NSigma refers to a moment of personal realization and liberation from previously held self-imposed restrictions. He portrays breaking free from the 'walls' or barriers that restricted him in the past."
    },
    {
      "text": "Will break me out this cage and turn the page to the intentional The stones I’m steady stacking start to sling 'em so I shatter glass",
      "annotation": "Continuing the vivid imagery about feeling confined, NSigma eloquently conveys his journey of breaking free and progressing toward his goals. The metaphor of 'shattering glass' with the 'stones' he’s gathered further underscores his determination."
    }
  ]
}